Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsError Property
 The solution is failing to do segments which are parallel and should intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToIntersectParallelSegmentsError { get; }
Public Shared ReadOnly Property FailToIntersectParallelSegmentsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToIntersectParallelSegmentsError {
	FailureDefinitionId^ get ();
}
static member FailToIntersectParallelSegmentsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace